Repository: ifs-net/MyProfile
Catalog: modules/MyProfile/locale/*/LC_MESSAGES/module_myprofile.po
Languages: de

source: You can now use the following form to search for other users. The more fields you fill out the less results you will get.
de: Dieses Formular kann benutzt werden, um Benutzer zu suchen. Je mehr Felder ausgefüllt werden umso weniger Suchergebnisse werden angezeigt, da die Suche hierdurch eingeschränkt wird.

source: Search string in all fields
de: Begriff (Suche in allen Feldern)

source: Choosing more than one item will link them using OR
de: Hier dargestellte Felder werden mit "oder" verknüpft.

source: There are no more searchable fields or you do not have the permission to view these fields
de: Es sind keine Suchmöglichkeiten freigegeben oder es fehlen die notwendigen Benutzerrechte, eine Suche durchzuführen

source: Search type
de: Suchoption

source: Connector for search logic
de: Logische Verbindung mehrere Felder

source: Sort result by
de: Sortieren nach

source: Using the search type soft and searching for sun you will also get results like sunset because the searched word is in it. If you do not want to use this select exact as search type!
de: Wenn der Suchtyp "soft" verwendet wird, werden bei Suche nach "Sonne" auch Ergebnisse mit "Sonnenschein" im Suchausdruck angezeigt. Wenn exakt nur das Gesuchte angezeigt werden soll, bitte Suchtyp "genau" wählen.

source: If you just click the search button without any search parameters you will get the whole member list displayed
de: Um alle Benutzer anzuzeigen einfach ohne Suchparameter die Suche starten

source: Your profile's configuration
de: Deine Profilkonfiguration

source: Manage the existing fields
de: Verfügbare Felder bearbeiten

source: If you want to change the order just click on the box and move the item to the position you want it to be. Settings will be stored automatically!
de: Wenn die Reihenfolge verändert werden soll diese einfach per Drag-and-Drop sortieren. Änderungen werden direkt gespeichert!

source: mandatory field
de: Pflichtfeld

source: optional field
de: Optionales Feld

source: viewable by registered users only
de: sichtbar nur für registrierte Benutzer

source: viewable by admin users only
de: nur für Administratoren sichtbar

source: characters
de: Zeichen

source: 0 = unlimited text
de: 0 = unbegrenzte Zeichenkette

source: Activated
de: Aktiviert

source: shown
de: gezeigt

source: Also store value as following user attribute
de: Wert auch als Benutzerattribut speichern

source: modify this field
de: Feld bearbeiten

source: Move up
de: Nach oben

source: Move down
de: Nach unten

source: There are
de: Es sind

source: members online
de: Mitglieder online

source: MyProfile backend configuration
de: MyProfile Administrationsbackend

source: Some modules have plugins for the profile module. For developers: Please take a look at the plugins.txt file in the documentation directory. Found plugins will be used automatically.
de: Einige Module halten Plugins für MyProfile bereit. Für Entwickler empfiehlt sich ein Blick in die plugins.txt-Datei im Dokumentationsverzeichnis dieses Moduls. Gefundene Plugins werden automatisch integriert.

source: If you want to remove a plugin from a user's profile page jsut delete the pnmyprofileapi.php in the root folder of the modules you want to remove
de: Wenn ein Profilplugin nicht angezeigt werden soll, bitte einfach die pnmyprofileapi.php aus dem entsprechendem Modulverzeichnis entfernen.

source: No plugins found!
de: Keine Plugins gefunden

source: General module settings
de: Allgemeine Moduleinstellungen

source: Appearance
de: Darstellung

source: Profile display configuration
de: Konfiguration der Profilanzeige

source: Date format to be used
de: Zu verwendendes Datumformat in der Profilausgabe

source: No-tab mode for user's profile management page
de: Tab-Mode deaktivieren auf der Eingabeseite der Profildaten für die Benutzer

source: Do not use AJAX for plugin loading
de: Kein AJAX beim Laden der Plugininhalte verwenden

source: Convert content loaded via AJAX to UTF8
de: Per AJAX nachgeladene Inhalte in UTF8 kodieren

source: Use profile separators as tabs. Might be interesting for huge profile pages
de: Profil-Trenner (Separatoren) als Tabs nutzen (für große Profile empfohlen)

source: Search engine configuration
de: Konfiguration der Suchmaschine

source: Results that should be shown per page
de: Anzahl der im Suchergebnis anzuzeigenden Ergebnisse pro Seite

source: Allow users to access the whole member list in entering no search string
de: Suchenden erlauben die komplette Mitgliederliste einzusehen, z.B. wenn kein Suchparameter übergeben wurde

source: You can specify a tempalte that should be included in the vcards that are displayed in a search result page that will have all user data assigned; Enter filename to use this feature
de: Nutze ein selbstverfasstes Template (Dateinamen angeben), welches auf der Suchergebnisseite für die gefundenen Mitglieder jeweils benutzt werden soll

source: URL for search engine
de: URL für Suchmaschine

source: Show users in map
de: Benutzer auf Karte anzeigen

source: You can show all users that have filled out a field (fieldtype: COORD) using the following url
de: Wenn Feldtyp KOORDINATE verwendet wird, können die Benutzer in eine Karte eingeblendet werden unter zuhilfenahme folgender URL

source: MyMap module has to be installed for this feature
de: MyMap muss installiert sein, um dieses Feature nutzen zu können

source: Email address management
de: Emailadressverwaltung

source: Do not force verification within email change requests
de: Keine Verifizierung der Emailadresse verlangen, wenn diese vom Benutzer geändert wird

source: Forbid new change request within
de: Erneute Änderung verbieten innerhalb von

source: days after last request
de: Tagen nach der letzten Änderung

source: Validation code's expiration of validity
de: Verfallszeit des Validierungs-Codes

source: days
de: Tage

source: It is possible to exclude users that use invalid email addresses from site usage. To use this feature you have to include the following function call into your templates
de: Es ist möglich, Benutzer zu sperren, welche eine falsche Emailadresse angegeben haben. Ein solcher, der Liste hinzugefügter Benutzer, kann sich beim nächsten Login zwar einloggen, ist aber gezwungen, seine Emailadresse zu aktualisieren. Dann wird er ausgeloggt und kann sich nur mit einer gültigen Emailadresse erst wieder anmelden. Hierzu muss in jedes Template folgender Smarty-Code integriert werden

source: Manage invalid email addresses
de: Ungültige Emailadressen verwalten

source: Behaviour
de: Verhalten

source: Send email notification to site admin when new registration is finished
de: Benachrichtigung an Administrator bei Neuregistrierungen

source: Also store profile as a user object attribute
de: Profil auch als Attribut des Benutzer-Objekts speichern

source: Valid profile mandatory for every user
de: Benutzer müssen vor Nutzung der Seite ihr Profil ausfüllen

source: User profile's expiration of validity
de: Verfallszeit des Benutzer-Profils

source: in seconds, 0 = no expiration
de: in Sekunden, 0 = kein Verfall

source: If you only want to force every user to complete the profile insert the code and set the expiration period to 0
de: alls die Benutzer nur gezwungen werden sollen, das Profil zu komplettieren, den Code einfügen und den Verfallszeit auf 0 setzen

source: User's permissions
de: Benutzerrechte

source: Allow users to set individual permissions who can see their profile page
de: Erlaube es jedem Benutzer selbst zu bestimmen, wer sein Gesamtprofil sehen darf

source: Users should be allowed to upload theis own templates for their profile.
de: Benutzern das Hochladen eigener Profil-Vorlagen gestatten.

source: Exclude selected groups from the permission to upload and use own individual profile templates
de: Folgende Gruppen sollen keine individuellen Templates nutzen dürfen

source: Update configuration
de: Konfiguration aktualisieren

source: Integrate user profiles into any zikula content
de: Benutzer-Profile in jeden Zikula-Inhalt integrieren

source: There is a plugin that can be called in any module with this piece of code
de: Ein Plugin kann aus jedem anderen Modul mit folgendem Code-Stück aufgerufen werden

source: But you have to configure this plugin via its template manually - the template file that has to be edited is
de: Aber dieses Plugin muss über seine Vorlage manuell konfiguriert werden - die zu bearbeitende Vorlagen-Datei ist

source: User's menu
de: Benutzermenü

source: my profile data
de: Meine Profildaten

source: email address, password and extended settings
de: Zugangsdaten und Profileinstellungen

source: search members
de: Mitgliedersuche

source: My profile
de: Mein Profil

source: Here you can define some custom settings for your profile
de: Hier können einige Einstellungen für Dein Profil festgelegt werden

source: General settings
de: Allgemeine Einstellungen

source: My timezone
de: Meine Zeitzone

source: Do not allow other users to comment my profile
de: Anderen Benutzern nicht erlauben mein Profil zu kommentieren

source: My profile page should be accessable by
de: Mein Profil soll sichtbar sein für

source: Profile data fields that are marked as private should be viewable by
de: Einige Profildaten sind als privat deklariert. Diese sollen sichtbar sein für

source: Manage users that are allowed to view all my data that is declared as private
de: Liste der Benutzer verwalten, welche meine diese privaten Daten sehen dürfen

source: Use an individual template
de: Individuelle Vorlage benutzen

source: Some hints to create your own template
de: Einige Hinweise zur Benutzung eigener Vorlagen

source: The individual profile tempalte can be designed in HTML
de: Die Vorlage kann in HTML entworfen werden.

source: The use of the following words (bold printed) will cause a replacement with your profile data - with * marked variables are mandatory and have to be used in your template
de: Die Fettgedruckten Wörter werden im Template automatisch ersetzt mit den jeweiligen eigenen Profildaten. Mit einem Stern versehene Variablen müssen zwingend in der Vorlage vorkommen

source: will be replaced with
de: wird ersetzt durch

source: Manage your password
de: Mein Passwort verwalten

source: If you want to change your password enter the new one
de: Wenn das Passwort geändert werden soll, bitte hier das neue Passwort eingeben

source: and repeat the new password please
de: und das Passwort zur Sicherheit nochmal wiederholen

source: Change email address
de: Emailadresse ändern

source: New email address
de: Neue Email-Adresse

source: Enter verification code for new email address
de: Emailadressen-Verifikationscode für neue Emailadresse eingeben

source: save / update
de: speichern / aktualisieren

source: User's email address
de: Email-Adresse des Benutzers

source: An error occured. Please regard the error message!
de: Ein Fehler ist aufgetreten, bitte Fehlermeldung beachten.

source: A directory inside the MyProfile module named
de: Ein verzeichnis innerhalb MyProfile genannt

source: This directory has to be writable by the webserver
de: Dieses Verzeichnis muss schreibbar durch den Webserver sein.

source: In this directory a file called tabledef.inc will be created by the module
de: In diesem Verzeichnis wird eine Datei mit dem Namen tabledef.inc erstellt

source: This file has to be readable by the webserver
de: Diese muss durch den Webserver lesbar sein

source: This file has to be writable by the webserver
de: Diese Datei muss durch den Webserver beschreibbar sein

source: Try again and proceed
de: Bitte erneut versuchen und fortfahren

source: User Name
de: Benutzername

source: main / modify user
de: Hauptseite / Benutzer bearbeiten

source: module configuration
de: Modul-Konfiguration

source: profile configuration
de: Profil-Konfiguration

source: profile plugins
de: Profil-Plugins

source: Show my own profile page
de: Mein Profil anzeigen

source: Show all tabs on one page
de: Alle Karteireiter als eine Seite darstellen

source: Switch to the tab-mode
de: Zur Profilreiter-Ansicht wechseln

source: Manage your community profile
de: Benutzerprofil verwalten

source: Please fill the form with your input. Every field that is marked with this sign: * is mandatory.
de: Bitte die folgenden Felder ausfüllen. Jedes mit * markierte feld ist ein Pflichtfeld.

source: Please click on the tabs above this text to get to the separated sections to manage your profile data. Please click the save-Button only if the profile is completely filled out!
de: Bitte auf die Karteireiter über diesem Text klicken um alle Bereiche des Benutzerprofils bearbeiten zu können. Nachdem alle Karteireiter ausgefüllt wurde, kann das Profil gespeichert werden.

source: Viewable for
de: Sichtbar für

source: Private field, only viewable by users you allow to access this data
de: Privates Feld, nur sichtbar für speziell freigegebene Benutzer

source: Longitude
de: Längengrad

source: Latitude
de: Breitengrad

source: Enter verification code to activate new email address
de: Verifikationscode für die Aktivierung der neuen Emailadresse eingeben

source: Verification code (25 characters)
de: Verifikationscode (25 zeichen)

source: Your user ID
de: Benutzer-ID

source: Activate new email address
de: Neue Emailadresse aktivieren

source: Sorry, no authorisation
de: Kein Zugriff

source: The main profile part is not accessible by you
de: Keine Zugriffsberechtigung auf das Benutzerprofil

source: Registered users
de: Registrierte Benutzer

source: Active users
de: Aktive Benutzer

source: Active in last two weeks
de: Aktiv in letzten 2 Wochen

source: Active in last month
de: Aktiv letzten Monat

source: Active in last two months
de: Aktiv in letzten zwei Monaten

source: Active in last three months
de: Aktiv in letzten drei Monaten

source: Active in last six months
de: Aktiv in letzten sechs Monaten

source: Active in last year
de: Aktiv letztes Jahr

source: New registrations in last month
de: Neue registrierungen im letzten Monat

source: Users with a myprofile profile
de: Benutzer mit MyProfile-Profil

source: Users without a myprofile profile
de: Benutzer ohne MyProfile-Profil

source: Users with invalid email address
de: benutzer mit ungültiger Emailadresse

source: Users with invalid email address and no changes in last month
de: Benutzer mit ungültiger Emailadresse und keiner Aktualisierung derselbigen im letzten Monat

source: Range for graphical statistics
de: Anzeigezeitraum für Grafik

source: User-defined: Please specify range in days as url parameter named
de: benutzerdefiniert: Bitte den zeitraum mit dem foglenden URL-Parameter spezifizieren

source: Explanation
de: Erklärung

source: active accounts
de: aktive Accounts

source: online last 2 weeks
de: online in letzten 14 Tagen

source: online last month
de: online im letzten Monat

source: online last 2 months
de: online die letzten 2 Monate

source: online last three months
de: online die letzten drei Monate

source: online last 6 months
de: online die letzten 6 Monate

source: online last year
de: online letztes Jahr

source: Field in the database in which the value for the user's birthday is stored in the format YYY-MM-DD (format: DATE)
de: Feld in der Datenbank, welches den Wert des Geburtstags des Benutzers aufweist (Format: DATE, also YYYY-MM-DD)

source: -- nothing is chosen --
de: -- nichts gewählt --

source: Field for restrictions, for example if a field is existing in which the user can manage if his birthday should be hidden and not shown in the list
de: Feld für Restriktion, wenn zum Beispiel ein Feld existiert, welches die öffentliche Anzeige des Geburtstags regelt

source: -- nothing is chosen. Empty if no restriction field should be used --
de: -- keine Restriktion --

source: Enter the value the restriction field should have if you want to show the birthday in the list
de: Wert welchen das Feld haben muss, dass der Geburtstag öffentlich im Geburtstagsblock gezeigt wird

source: You requested to change your email address at
de: Es wurde das Aktualisieren der eingetragenene Emailadresse beantragt bei

source: To activate your new email address click the following link please
de: Um die neue Emailadresse zu aktivieren bitte folgenden Link anklicken und den Code dort bestätigen

source: If this link is broken use the following website and enter your verification code there
de: Wenn der Link nicht funktioniert, bitte den Verifikationscode manuell auf der Seite eingeben

source: To use the alternate URL you have to enter the following data
de: Um diese alternative URL zu nutzen müssen folgende Daten dort eingegeben werden

source: This code is valid until
de: Der Code ist gültig bis

source: or up to a new request by yourself
de: oder bis ein neuer Code angefordert wird

source: Please do not respond to this automatically created email - contact the website administrator if there are any problems
de: Bitte nicht auf diese automatisch vom System generierte Email antworten - bei Problemen bitte an den Administrator der Seite wenden

source: more/less
de: mehr / weniger
