Repository: ifs-net/MyProfile
Catalog: modules/MyProfile/locale/*/LC_MESSAGES/module_myprofile.po
Languages: de

source: Latest registrations
de: Neue Profile

source: Show latest user registrations
de: Neueste Anmeldungen und Profile anzeigen

source: Sum
de: Summe

source: registered users since
de: registrierte Benutzer seit

source: no permission to view this field
de: keine Leseberechtigung für diese Daten

source: You can not request a new validation code before
de: Vor folgendem Zeitpunkt kann kein neuer Validierungscode angefordert werden

source: Attention: You have to activate your new email address before using this site again! Please read the instructions in the incoming email!
de: Bevor die neue Emailadresse verwendet werden kann muss diese erst aktiviert werden. Hierzu wurde ein Aktivierungsemail an die neue Emailadresse geschickt. Die dort enthaltenen Instruktionen müssen befolgt werden - dann erst wird die neue Emailadresse aktiv gesetzt.

source: Email verification code for
de: Emailadressen-Verifikationscode für

source: at
de: bei

source: Show user's profile
de: Zeige Benutzerprofil

source: The advances template based zikula profile module
de: Das flexiblere Profilmodul für Zikula

source: My profile data
de: Meine Profildaten

source: My password
de: Mein Passwort

source: My email address
de: Meine Email-Adresse

source: Profile data deleted for user
de: Die Profildaten wurden gelöscht für den Benutzer

source: User-Profile
de: Benutzerprofil

source: Error registering System Init Hook for MyProfile module
de: Ein Fehler ist beim Registrieren des System-Init-Hooks für das Module MyProfile aufgetreten. Bitte prüfen und ggf. manuell den Hook für MyProfile an den Zikula core aktivieren.

source: System Init Hook was created for MyProfile module
de: Ein System-Init-Hook wurde erfolgreich für MyProfile erstellt.

source: System Init Hook remove error
de: Ein Fehler ist beim Entfernen des System-Init-Hooks aufgetreten. Das Modul wird dennoch deinstalliert, ggf. sind in der Datenbank für Hooks jedoch noch Rückstände. Ein Problem für die Funktionalität von Zikula ist dies jedoch nicht.

source: System Init Hook for MyProfile module was removed
de: Der für MyProfile notwendige System-Init-Hook wurde erfolgreich entfernt

source: MyProfile systeminit hook created
de: Systeminithook wurde angelegt

source: Config file could not be created - please check the config directory permissions.
de: Die Konfigurationsdatei für MyProfile konnte nicht angelegt werden. Bitte prüfen Sie die Datei- und Verzeichnisberechtigungen.

source: The file modules/MyProfile/config/tabledef.inc has to be writable. If the file does not exist yet, the folder config has to be writeable.
de: Die Datei modules/MyProfile/config/tabledef.inc muss beschreibbar sein. Wenn die Datei selbst noch nicht existiert, muss der Ordner beschreibbar sein.

source: Config file is not readable - change this before trying to edit the actual configuration.
de: Die Konfigurationsdatei kann nicht eingelesen werden. Bitte passen Sie die Rechte entsprechend an bevor Sie versuchen, die aktuelle Konfiguration zu bearbeiten.

source: Config file is not writeable - change this before trying to edit the actual configuration.
de: Die Konfigurationsdatei kann nicht beschrieben werden. Bitte passen Sie die Rechte entsprechend an bevor Sie versuchen, die aktuelle Konfiguration zu bearbeiten.

source: An error occured while trying to update the table definition
de: Beim Aktualisieren der Tabellendefinition ist ein Fehler aufgetreten.

source: Table definition updated successfully
de: Die Tabellendefinition wurde aktualisiert.

source: Table structure updated
de: Die Struktur der Profiltabelle wurde aktualisiert

source: Parameter is missing: no source given
de: Ein Parameter fehlt: Es wurde keine Quelle angegeben

source: An error occured importing the pnProfile configuration
de: Ein Fehler ist beim Import der pnProfile-Profildaten aufgetreten

source: pnProfile structure imported into MyProfile
de: Die pnProfile-Struktur wurde importiert

source: Import done
de: Import beendet

source: items imported
de: Profile wurden Importiert

source: One import step done.. This step has to be repeated in large communities
de: Ein Importschritt wurde durchlaufen. Bei großen Mitgliederdatensammlungen kann es sein, dass dieses mehrfach wiederholt werden muss

source: about
de: über

source: left
de: verbleibend

source: pnProfile configuration could not be read
de: die pnProfile-Konfiguration kann nicht ausgelesen werden

source: Parameter error: invalid source given
de: Parameter falsch angegeben: Ungültige Quelle spezifiziert.

source: Database was cleaned up
de: Die Datenbank wurde optimiert

source: MyMap module not found
de: Das MyMap-Modul konnte nicht gefunden werden

source: More than one coordinate field found. Please use the url parameter identifier and the value of the identifier you want to use as coordinate field and reload the page
de: Es wurde mehr als nur ein Koordinatenfeld in der Profilstruktur gefunden. Bitte nutzen Sie den URL-Parameter, um das gewünschte, zu verarbeitende Koordinatenfeld zu spezifizieren und laden Sie damit die Seite neu.

source: User deleted
de: Benutzer wurde gelöscht

source: An error occured while trying to delete the user
de: Beim Löschen eines Benutzer trat ein Fehler auf

source: Profile of user
de: Profil von

source: The username you specified does not exist
de: Der angegebene Benutzername exitiert nicht oder hat noch kein Profil

source: I hope you trust yourself, but you cannot add your own username to your list
de: Wir hoffen, dass sich jeder selbst traut... Der eigene Benutzername kann nicht zu dieser Liste hinzugefügt werden!

source: User already marked
de: Bbenutzer wurde bereits ausgewählt

source: An error occured while trying to add the user to your list
de: Beim Hinzufügen des Benutzers trat ein Fehler auf

source: User was added to the list
de: Der Benutzer wurde hinzugefügt

source: Updating / creating user attributes failed
de: Beim Aktualisieren bzw. Erstellen der Benutzerattribute trat ein Fehler auf

source: Profile was updated successfully
de: Das Profil wurde aktualisiert

source: Creating / Updating profile failed
de: Beim Aktualisieren / Erstellen des Profils ist ein Fehler aufgetreten

source: The profile was created successfully
de: Das Profil wurde erstellt

source: Username
de: Benutzername

source: exact
de: genau

source: AND
de: UND

source: OR
de: ODER

source: ASC
de: aufsteigend

source: DESC
de: absteigend

source: Your email address was updated successfully
de: Die Emailadresse wurde aktualisiert

source: An error occured while trying to change your email address
de: Beim Ändern der Emailadresse ist ein Fehler aufgetreten

source: Verification code incorrect
de: Verifikationscode nicht korrekt

source: Verification code is no longer valid - you should start a new request for a new verification code
de: Verifikationscode inzwischen ungültig. Bitte neuen Verifikationscode für den Wechsel der Emailadresse beantragen und die Änderung schnellstmöglich durchführen

source: viewable by everybody
de: sichtbar für jeden

source: all members
de: alle Mitglieder

source: confirmed buddies
de: Freunde

source: only listed users
de: individuelle Nutzerauswahl

source: You have to include all mandatory profile variables into your individual template
de: Alle als Pflichtfelder gekennzeichneten Daten müssen im individuellen Template vorhanden sein

source: Settings updated successfully
de: Einstellungen wurden aktualisiert

source: The new password was not entered twice the same way - there might be a typo in a password - password was not changed
de: Das Passwort wurde nicht übereinstimmend angegeben. Bitte auf Tippfehler, Groß- und Kleinschreibung prüfen. Passwort wurde daher nicht geändert.

source: Your password was changed successfully
de: Das Passwort wurde aktualisiert

source: The new password is too short
de: Das neue Passwort ist zu kurz

source: An verification email with further instructions has been sent to your new email address.
de: Ein Verifizierungscode mit weiteren Anweisungen zur Beendigung dieses Schrittes wurde an die neue Emailadresse geschickt. Nachdem diese Schritte durchlaufen sind, wird die neue Adresse erst aktiv.

source: An error occured while trying to send an verification code to your new, entered email address
de: Der Verifikationscode konnte nicht an die neue Emailadresse geschickt werden

source: Email address could not be found in user database
de: Die Emailadresse konnte nicht in der Datenbank gefunden werden

source: User marked
de: Benutzer markiert

source: Error while trying to mark the user
de: Beim markieren des Benutzers ist ein Fehler aufgetreten

source: No
de: Nein

source: Yes
de: Ja

source: String
de: Zeichenkette (String)

source: Integer
de: Ganzzahliger Wert (Integer)

source: Float
de: Gleitkommazahl (Float)

source: String (multiline)
de: Mehrzeilige Zeichenkette (string, multiline)

source: Url
de: Internetadresse (URL)

source: ICQ-UIN
de: ICQ-Nummer (UIN)

source: Date
de: Datum

source: Timestamp
de: Datum und Zeit

source: Coordinate
de: Koordinate

source: This field will be shown to everybody
de: Dieses Feld wird für jeden sichtbar sein

source: Only registered users will be able to see this field's value
de: Nur registrierte Mitglieder werden den Inhalt dieses Feldes sehen können

source: Only the administrator will be able to see this field's value
de: Nur der Administrator wird Zugriff auf den Inhalt dieses Feldes haben

source: The user can choose who should be able to see this field's value
de: Der Benutzer kann individuell festlegen, wer dieses Feld sehen können soll

source: Error while deleting the fields
de: Beim Löschen der Felder ist ein Fehler aufgetreten

source: Field was deleted successfully
de: Das Feld wurde gelöscht

source: Existing field was updated successfully
de: Das Feld wurde aktualisiert

source: A field named with this identifier exists already - please choose another value for the identifier!
de: Ein feld mit dieser Feldbezeichnung (Identifier) existiert bereits. Bitte den Feld-Wert anpassen / ändern!

source: The identifier must not contain any other characters than numbers (0-9) and regular characters (A-Z, a-z)
de: Der Identifier-Wert darf nur Nummern und Buchstaben und keine Sonderzeichen enthalten

source: New field was created successfully
de: Das Feld wurde erstellt

source: Configuration updated successfully
de: Die Konfiguration wurde aktualisiert

source: Your profile is outdated or incomplete - please check / complete / update your personal data
de: Das Benutzerprofil ist abgelaufen oder unvollständig. Von Zeit zu Zeit kann es notwendig sein, die Profildaten zu überarbeiten und neu zu speichern. Bitte daher die persönlichen Profildaten überprüfen und aktualisieren / komplettieren / speichern

source: Your email address has to be updated before using this site! EMails came back to the administrator that did not reach you - valid email addresses are mandatory for this site! After changing your email address you will be able to use this site again!
de: Die eingetragene Emailadresse scheint ungültig zu sein, da Emails an diese nicht zugestellt werden konnten. Daher muss die Emailadresse zweingend überarbeitet werden bevor die Seite erneut benutzt werden kann. Bitte daher eine gültige Emailadresse eingeben.

source: Please fill out your personal profile first. This is neccessary before you can interact in this community!
de: Bevor diese Seiten vollständig genutzt werden können, muss ein persönliches Profil angelegt werden. Sobald dieser kleine Schritt erledigt ist, können die Inhalte der Seite benutzt werden!

source: New profile
de: Neues Profil

source: pnProfile migration reset done
de: pnProfile-Migration-Reset durchgeführt

source: Element was moved successfully
de: Element wurde erfolgreich verschoben

source: more than one user found
de: mehr als ein Nutzer gefunden

source: please choose one user and enter its username
de: bitte einen Benutzer auswählen und den Benutzernamen eingeben

source: email address not found
de: Emailadresse konnte nicht gefunden werden

source: No user with this username or user-ID found
de: Kein Benutzer mit diesem Benutzernamen oder der Benutzer-ID gefunden

source: User's main profile
de: Profil

source: good luck and a nice party!
de: alles Gute im neuen Lebensjahr!

source: Amount of items that should be shown in the newbie list
de: Anzahl an Einträgen, welche in der Liste der Neuanmeldungen erscheinen sollen

source: Welcome to our community!
de: Willkommen in unserer Community!

source: Welcome to MyProfile - the advanced zikula profile module!
de: Willkommen bei MyProfile - dem flexibleren Profilmodul für Zikula!

source: Modify profile
de: Profil bearbeiten

source: You can directly modify a user's profile in entering the
de: Ein Benutzerprofil direkt durch Eingabe von

source: username
de: Benutzername

source: E-mail address
de: Email-Adresse

source: or the user's ID
de: oder ID des Benutzers

source: ... and edit the user's profile
de: bearbeiten

source: Submit
de: Senden

source: Cancel
de: Abbruch

source: Support this module
de: Unterstütze dieses Modul

source: You like this module and it is usefull for you? Thank you for some little donation for the programmer! OK - I like programming very much and this module is free and open source - but if you spend some money I'll go out for a nice candlelight dinner with my girlfriend and it will be much easier next time to get free time for programming ;-)
de: Du magst dieses Modul und es nützt Dir? Dann wäre Dir der Programmierer für eine kleine Spende sehr dankbar! Na klar - ich programmiere sehr gerne und das Modul ist natürlich kostenlos und Open-Source - aber wenn Du etwas springen lässt, dann könnte ich meine Freundin zum Abendessen ausführen und es wird das nächste mal viel leichter sein, zum Programmieren frei zu bekommen ;-)

source: Donate with PayPal!
de: Mit PayPal Spenden

source: repair
de: Reparieren

source: This function checks the consistency of your MyProfile database. This check might be neccessary, if you allow your user's to delete their accounts themself or if your delete users using the function the Users module offers you. In this case, old data might still be stored in the MyProfile tables. This function is the "garbage collector" for this module.
de: Diese Funktion prüft die Konsistenz der Datenbank. Das kann manchmal notwendig sein, wenn man z.B. Benutzeraccounts löschen lässt oder gelöscht hat. Diese Funktion räumt hier auf.

source: You have
de: Du hast

source: orphans
de: Verwaiste Datensätze

source: Clean up database
de: Datenbank aufräumen

source: Database already optimized
de: Die Datenbank ist bereits optimiert

source: This profile page cannot be displayed
de: Diese Profilseite kann nicht angezeigt werden

source: The user does not exist or there is no vaid profile available for this user yet.
de: Der Benutzer existiert nicht oder hat kein gültiges Profil angelegt

source: Go back one page
de: Eine Seite zurück

source: User's gallery
de: Bildergalierie

source: picture(s)
de: Bilder(er)

source: User linked at
de: Benutzer verlinkt auf

source: Override individual profile template
de: individuelle Profileinstellungen ignorieren

source: Registerd since
de: Registriert seit

source: Last update
de: Letzte Profilaktualisierung

source: Last login
de: Letzter Login

source: Send private message
de: Nachricht senden

source: Add as buddy
de: Als Freund hinzufügen

source: Modify an existing field
de: Bestehendes Feld bearbeiten

source: Add a new field
de: Neues Feld hinzufügen

source: You can add or modify a custom field for the user's profile here.
de: Hier kann ein beliebiges Feld des Benutzerprofils hinzugefügt und bearbeitet werden.

source: Due to some technical and logical reasons the type and identifier of a regular field can not be changed after the field was created.
de: Ein einmal angelegtes Feld kann beim Identifier festgelegten Wert sowie beim Feld-Typ nicht nachträglich geändert werden.

source: Type of this field
de: Feld-Typ

source: Identifier for the field (and the name of the column in the database) or title of the separator (if type is separator)
de: Identifier (wird auch Spalte der Profiltabelle in der Datenbank) bzw. Titel (für den Fall, dass es sich um einen Separator handelt)

source: Should this field be mandatory
de: Soll das Feld ein Pflichtfeld sein

source: Description
de: Beschreibung

source: Minimal value for integer or float
de: Minimumwert für Integer oder Float

source: Maximal value for integer or float
de: Maximalwert für Integer oder Float

source: Maximal length of string
de: Maximale Länge der Zeichenkette

source: List (for building a dropdown menu)
de: Liste (wenn ein Dropdown-Menü gebildet werden soll)

source: Example code for dropdown menus: @@value to store||text to show
de: Beispielcode für ein Dropdown-Menü: @@Wert für die Datenbank||Text, welcher als Menüpunkt erscheinen soll

source: @@daily||I want the daily newsletter @@monthly||Send a newsletter every month @@no||I do not want to recieve newsletters
de: @@daily||Täglicher Newsletter gewünscht @@monthly||Monatlicher Newsletter gewünscht @@no||Kein Newsletter gewünscht

source: Example code for radiobutton menus: @*value to store||text to show
de: Beispielcode für Auswahl via Radiobutton-Menü: @*zu speichernder Wert||Anzuzeigender text

source: @*0||No @*1||Yes
de: @*0||Nein @*1||Ja

source: Public status
de: Öffentliche Sichtbarkeit

source: Should this field be writeable and shown in the user's profile configuration
de: Soll das Feld durch den Benutzer beschreibbar sein

source: Should this field be shown on the user's profile page that will be generated by this module
de: Soll der vom Benutzer gespeicherte Wert auch in der automatisch generierten Profilansicht gezeigt werden

source: Field should be searchable by all users doing a search
de: Feld soll durchsuchbar sein und in der Suchfunktion angeführt werden

source: Name of user attribute / property to store the users value also as user attribute. Example: Entering _REALNAME here will make MyProfile to store the user's value also as _REALNAME
de: Name des Attributs / der Benutzervariable, unter welcher die Eingabe des Benutzers zusätzlich bei der Änderung / dem Abspeichern mit gespeichert werden soll. Beispiel: _REALNAME wird MyProfile dazu veranlassen, die Variable dann als Benutzervariable _REALNAME zusätzlich zu speichern.

source: Delete this field
de: Dieses Feld löschen

source: Update / create field
de: Feld erstellen / aktualisieren

source: Import data from pnProfile
de: Daten von pnProfile importieren

source: pnProfile module is available on your system. If you want to import data from this module to use it in the MyProfile module you can do this here. If you used a database dump to reconstruct pnProfile data make sure, that you also need the Users tables - not only the pnProfile tables are important!
de: pnProfile ist installiert auf diesem System. Hier können diese Daten in MyProfile importiert werden. Wenn Sie einen SQL-Dump benutzt haben um die Daten zu rekonstruieren stellen Sie sicher, dass auch die Users-tabelle vorhanden ist. Nicht nur die pnProfile-Tabelle ist wichtig!

source: Start import now
de: Import starten

source: Migration from pnProfile to MyProfile already done
de: Die Migration wurde bereits durchgeführt

source: import pnProfile structure
de: Stuktur von pnProfile importieren

source: If you have already configured MyProfile your configuration will be lost! Also values users might have entered already will be lost! Merging is not supported!
de: Wenn MyProfile bereits konfiguriert wurde wird diese Konfiguration verloren gehen!

source: update table definition
de: Tabellendefinition aktualisieren

source: update table
de: Tabelle aktualisieren

source: import pnProfile data into MyProfile
de: importiere pnProfile-Daten in MyProfile

source: If you have a huge pnProfile database the update might break if the memory limit or the timeout is set to low. If the update breaks, raise your memory limit and the php maximum execution time and try this step again until it works! Also do not run any other processes you do not need when importing the database.
de: Bei einer sehr großen pnProfile-Datenbank kann es zu Timeouts oder Problemen mit einem eingestellten, niedrigen PHP-Memory-Limit kommen. Sollte das Update fehlschlagen, Memorylimit und maximum execution time erhöhen udn erneut versuchen, bis es geht. Es empfiehlt sich zusätzlich, alle anderen Anwendugen am Server für diese Zeit zu stoppen.

source: Migration failed
de: Migration mit Fehler abgebrochen

source: Reset migration and start with first step again
de: Migration zurücksetzen und mit erstem Schritt beginnen

source: pnProfile is not available on your system. No import possible.
de: pnProfile ist nicht im System verfügbar, ein Import daher nicht möglich.

source: Import data from Profile
de: Daten von pnProfile importieren

source: Profile module found on your system. You can import all data from Profile module into MyProfile.
de: Das Profile-Modul wurde gefunden. Daten können in MyProfile importiert werden.

source: Attention: You first have to setup the structur of the MyProfile user profile. Having done this will enable you to import User-Properties step by step for each user... Just choose the porperty, the target the data should be written into and then import from Profile module.
de: Achtung: Zuerst muss das Benutzerprofil angelegt sein. Nachdem dies getan ist, können die Benutzerattribute, welche das Profile-Modul speichert, importiert werden. Dazu bitte das gewünschte Benutzerattribut wählen und das Zielfeld, welches in MyProfile damit befüllt werden soll, wählen. Dann wird ein SQL-Dump generiert, welcher noch ausgeführt werden muss. Dann sind die Daten importiert.

source: After selecting a source user property and a destination MyProfile identifier you will have some sql code shown in here. Please copy and paste this code and execute it in phpmyadmin for example to import your Profile data into MyProfile
de: Nachdem ein zu importierende Benutzerattribut ausgewählt wurde, wird hier entsprechender SQL-Code dargestellt. Diesen bitte in Tools wie phpmyadmin manuell ausführen und so Stück für Stück und Attribut für Attribut die Daten importieren

source: Source field
de: Quellen-Feld

source: Destination field
de: Zielfeld

source: If your memory limit is to low or your database to huge you can select a start and stop interval for user IDs
de: Falls das Memory-Limit des Servers zu gering ist bzw. die Benutzerdatenbank zu groß ist bitte Intervallweise die Daten importieren.

source: Begin of User-ID interval
de: Start der Benutzer-ID-Intervalls

source: End of User-ID interval
de: Ende des Benutzer-ID-Intervalls

source: Import this user property
de: Benutzerattribut importieren

source: The regular Profile module could not be found on your system. No Import possible.
de: Das reguläre Profie-Modul wurde nciht gefunden - kein Import möglich

source: Manage users that can see your private data
de: Benutzerliste, welche als privat deklarierte Daten sehen kann, verwalten

source: Add a new user to your list
de: Neuen Benutzer der Liste hinzufügen

source: add
de: hinzufügen

source: Your list
de: Deine Liste

source: delete User
de: Benutzer löschen

source: No entry was made yet
de: Es wurde kein Eintrag gefunden

source: Found
de: gefunden

source: results
de: Ergebnisse

source: Show search form to change search parameters
de: Suchmaske anzeigen

source: Show all members
de: Alle Mitglieder anzeigen

source: Page
de: Seite

source: result
de: Ergebnis

source: previous page
de: Vorherige Seite

source: next page
de: nächste Seite

source: Search
de: Suchen
